In this hands-on tutorial, we'll learn how to work with databases with Pandas. We will also review how to connect to SQLite with the sqlite3 module and try the same process with SQLAlchemy. Let's dive straight into it!

First, let's import the necessary libraries:

In [1]:
# import sqlite3
import sqlite3 as sqlite

# import pandas
import pandas as pd

# import sqlalchemy
from sqlalchemy import create_engine

Note
If you haven't installed SQLAlchemy before, please install it with the well-known approach with pip or conda.

For demonstration purposes, we'll create a database, `population.db`, and insert one table with the name, Population, which represents the population in different countries.

In [2]:
with sqlite.connect('data/population.db') as con:
    cur = con.cursor()    
    cur.execute("CREATE TABLE IF NOT EXISTS Population(id INTEGER PRIMARY KEY, country TEXT, population INT)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Germany',81197537)")
    cur.execute("INSERT INTO Population VALUES(NULL,'France', 66415161)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Italy', 60795612)")
    cur.execute("INSERT INTO Population VALUES(NULL,'Spain', 46439864)")

# Connection with SQLAlchemy
We have already learned how to make a connection to the SQLite database with the sqlite3 module. Another option is, to connect to the SQLite (or any other supported databases) database using SQLAlchemy. This type of connection is also recommended by Pandas.

Let's create a connection with SQLAlchemy.

In [4]:
connection = create_engine('sqlite:///population.db')

The syntax is as simple as that. The only required parameter in the create_engine function is a connection string. This connection string consists of the name of the database driver and the name of the database we want to connect.
* For this connection string to work, population.db needs to be in the same directory as our notebook. If we choose a different directory, we then need to adjust the string accordingly.

# Reading SQL data with Pandas

## ```read_sql_query()```
This method requires two parameters as input. The first parameter is a string with a SQL query and the second one is a connection to the database. Let's try to read all the rows from our Population table.

In [6]:
# create SQL query
sql = 'SELECT * FROM Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql_query(sql, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

As we can see from code above, we loaded data from the database into the data-frame with only a few lines of code.

## ```read_sql_table()```
Another way to load data from the database and into the data-frame is the read_sql_table() method. Compared to the read_sql_query() method, the first argument is the table name instead of the SQL query. The second argument stays the same.

In [7]:
# table name
table = 'Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql_table(table, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

## ```read_sql()```
This function is a combination of the two mentioned above. Depending on the type of the first argument (SQL query or table name), this function internally calls `read_sql_query()` instead of `read_sql_table()`.

So we can use it both ways:
* with SQL query:

In [8]:
# create SQL query
sql = 'SELECT * FROM Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(sql, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864

* with table name:

In [10]:
# table name
table = 'Population'

with create_engine('sqlite:///population.db').connect() as con:
    df = pd.read_sql(table, con)
df

   id  country  population
0   1  Germany    81197537
1   2   France    66415161
2   3    Spain    46439864
3   4    Italy    60795612
4   5    Spain    46439864